package com.tsivas.test;

import static org.junit.Assert.assertTrue;

import java.util.ArrayList;

import org.junit.Test;

import retrofit.RestAdapter;
import retrofit.RestAdapter.LogLevel;

import com.google.appengine.api.datastore.Text;
import com.tsivas.client.PathSvcApi;
import com.tsivas.model.Alternative;
import com.tsivas.model.Hint;
import com.tsivas.model.Path;
import com.tsivas.model.Quest;
import com.tsivas.model.Question;
import com.tsivas.model.Task;

public class PathSvcClientApiTest {

	
	//private final String TEST_URL = "http://localhost:8888";
	private final String TEST_URL = "http://1-dot-learningmycity.appspot.com";
	
	ArrayList<Quest> quests = new ArrayList<Quest>();
	ArrayList<Quest> quests2 = new ArrayList<Quest>();
	ArrayList<Task> tasks = new ArrayList<Task>();
	ArrayList<Task> tasks2 = new ArrayList<Task>();
	ArrayList<Question> questions = new ArrayList<Question>();
	ArrayList<Question> questions2 = new ArrayList<Question>();
	ArrayList<Alternative> alternatives = new ArrayList<Alternative>();
	ArrayList<Alternative> alternatives2 = new ArrayList<Alternative>();
	ArrayList<Hint> hints = new ArrayList<Hint>();
	ArrayList<Hint> hints2 = new ArrayList<Hint>();
	
	private PathSvcApi pathService = new RestAdapter.Builder()
	.setEndpoint(TEST_URL)
	.setLogLevel(LogLevel.FULL)
	.build()
	.create(PathSvcApi.class);
	
	@Test
	public void test() {
		
		// Path Thessaloniki

		// Quest - Lefkos Pyrgos
		quests.add(new Quest("Λευκός Πύργος", "2", new Text("Ο Λευκός Πύργος της Θεσσαλονίκης είναι οχυρωματικό έργο οθωμανικής κατασκευής του 15ου αιώνα (χτίστηκε πιθανόν μεταξύ 1450-70). Σήμερα θεωρείται χαρακτηριστικό μνημείο της Θεσσαλονίκης και είναι ό,τι έχει σωθεί από την κατεδαφισμένη οθωμανική οχύρωση της πόλης. Η σημερινή μορφή του πύργου αντικατέστησε τη βυζαντινή οχύρωση του 12ου αιώνα, για να χρησιμοποιηθεί στη συνέχεια ως κατάλυμα φρουράς Γενιτσάρων και ως φυλακή θανατοποινιτών. Σήμερα λειτουργεί ως μουσείο και είναι ένα από πιο γνωστά κτίσματα-σύμβολα πόλεων στην Ελλάδα. Έχει 6 ορόφους, 34 μέτρα ύψος και 70 μέτρα περίμετρο."), "1", "40.626351", "22.948337", "1", "0"));
				
		// Task 1
		tasks.add(new Task(new Text("Ο στόχος μας σε αυτή την αποστολή είναι ένα οχυρωματικό έργο οθωμανικής κατασκευής του 15ου αιώνα που θεωρείται μνημείο-σύμβολο της Θεσσαλονίκης και στο παρελθόν αποτελούσε το νοτιοανατολικό πύργο του τείχους της πόλης."), "0", "1", "3", "5", "0", "1", "40.626351", "22.948337", "100"));
		questions.add(new Question("Μεταφερθείτε στο παραπάνω κτίσμα", "", "1"));
		hints.add(new Hint("Το μνημείο σήμερα υψώνεται μοναχικό στην παραλία της πόλης.", "1", "2", "0"));
		hints.add(new Hint("Μια παλιά φωτογραφία του κτίσματος.", "1", "5", "2"));
		
		// Task 2
		tasks.add(new Task(new Text("Μετά την απελευθέρωση της Θεσσαλονίκης, υψώθηκε η ελληνική σημαία στην κορυφή του Λευκού Πύργου με ιστό το κεντρικό κατάρτι από το βυθισμένο στον Θερμαϊκό, από το τορπιλοβόλο Τ-11 του Νικολάου Βότση, τουρκικό θωρηκτό \"Φετίχ-Μπουλέν\""), "0", "3", "2", "5", "0", "1", "0", "0", "0"));
		questions.add(new Question("Ποιο έτος απελευθερώθηκε η Θεσσαλονίκη?", "1912", "2"));		
		hints.add(new Hint("Αρχές του 20ου αιώνα, κατά την διάρκεια του Α' Βαλκανικού πολέμου.", "2", "2", "0"));
		hints.add(new Hint("Το έτος βρίσκεται μεταξύ του 1910 και 1915.", "2", "4", "0"));
		
		// Task 3
		tasks.add(new Task(new Text("Στην είσοδό του εξωτερικού περιβόλου (τώρα κατεδαφισμένος) υπήρχε μια τουρκική επιγραφή του 1535-1536, η οποία εκτός από τη χρονολογία κατασκευής του περιβόλου, ανέφερε και το πρώτο όνομα του κτίσματος."), "0", "2", "1", "5", "0", "1", "0", "0", "0"));
		questions.add(new Question("Πως ονομαζόταν αρχικά ο Λευκός Πύργος?", "Πύργος του Λέοντος", "3"));
		alternatives.add(new Alternative("Πύργος του Αίματος","3"));
	    alternatives.add(new Alternative("Πύργος του Λέοντος","3"));
	    alternatives.add(new Alternative("Πύργος των Αετών","3"));
	    alternatives.add(new Alternative("Πύργος των Γενιτσάρων","3"));
	    hints.add(new Hint("Πήρε το όνομα του από ένα ζώο.", "3", "2", "0"));
		hints.add(new Hint("Το ζώο αυτό θεωρείται βασιλιάς της ζούγκλας.", "3", "4", "0"));

		// Task 4
		tasks.add(new Task(new Text("Από την ημέρα κατασκευής του έως σήμερα, ο Λευκός Πύργος έχει αλλάξει πολλούς ιδιοκτήτες και κατά συνέπεια πολλές ιδιότητες."), "0", "4", "4", "5", "0", "1", "0", "0", "0"));
	    questions.add(new Question("Μερικές από τις σημαντικότερες χρήσεις του ήταν ως:", "Φυλακή μελλοθανάτωνΚέντρο διαβιβάσεων των ΣυμμάχωνΕργαστήριο μετεωρολογίας", "4"));		
	    alternatives.add(new Alternative("Φυλακή μελλοθανάτων","4"));
	    alternatives.add(new Alternative("Φάρος της πόλης","4"));
	    alternatives.add(new Alternative("Κέντρο διαβιβάσεων των Συμμάχων","4"));
	    alternatives.add(new Alternative("Κέντρο μελετών υπηρεσιών υγείας","4"));
	    alternatives.add(new Alternative("Εργαστήριο μετεωρολογίας","4"));		
		hints.add(new Hint("Δεν ήταν ποτέ φάρος της πόλης.", "4", "2", "0"));
		hints.add(new Hint("Δεν ήταν ποτέ κέντρο μελετών υπηρεσιών υγείας.", "4", "4", "0"));
	    
		// Quest - Anaktoro Galeriou
	    quests.add(new Quest("Ανάκτορο Γαλερίου", "5", new Text("To Ανάκτορο του Γαλερίου αποτελεί συγκρότημα μεγάλης έκτασης η κατασκευή του οποίου ξεκίνησε στις αρχές του 4ου μ. Χ. αιώνα από τον αυτοκράτορα Γαλέριο. Πρόκειται για επίσημη κατοικία στην οποία φιλοξενούνταν ο αυτοκράτορας και η αυλή του, όταν διέμενε προσωρινά στην πόλη της Θεσσαλονίκης. Στο ανάκτορο παρέμειναν, συμφώνα με τις πηγές, πολλοί αυτοκράτορες του 4ου και του 5ου αιώνα μεταξύ των οποίων και ο αυτοκράτορας Θεοδόσιος Α. Το συγκρότημα, η ανασκαφή του οποίου δεν έχει ολοκληρωθεί, ήταν κτισμένο στις παρυφές της πόλης σε άμεση επαφή με τον Ιππόδρομο διπλά στα ανατολικά τείχη. Περιελάμβανε τα αυτοκρατορικά διαμερίσματα, εσωτερικές άυλες, καθώς και αίθουσες υποδοχής και ακροάσεων."), "2", "40.630318", "22.949490", "1", "0"));

	    // Task 5
	 	tasks.add(new Task(new Text("Ο στόχος μας σε αυτή την αποστολή είναι το μεγάλο ρωμαϊκό ανάκτορο-αυτοκρατορική κατοικία το οποίο βρίσκεται στο κέντρο της πόλης και αποτελεί το μοναδικό στο είδος του που σώζεται στην Ελλάδα."), "0", "1", "3", "5", "0", "2", "40.630318", "22.949490", "100"));
	 	questions.add(new Question("Μεταφερθείτε στο παραπάνω ανάκτορο", "", "5"));
	 	hints.add(new Hint("Η κατασκευή του ξεκίνησε στις αρχές του 4ου μ.Χ. αιώνα από τον αυτοκράτορα Γαλέριο.", "5", "2", "0"));
	 	hints.add(new Hint("Μια παλιά φωτογραφία του συγκροτήματος.", "5", "5", "5"));

	 	// Task 6
	 	tasks.add(new Task(new Text("Το ανάκτορο του Γαλερίου αποτελεί μέρος ενός μεγάλου συγκροτήματος κτισμάτων το οποίο καταλάμβανε μια έκταση περίπου 150.000 τ.μ., τα κτήριά του οποίου ήταν διατεταγμένα σε ευθεία με άξονα από βορρά προς νότο, εκτεινόταν ως τη θάλασσα και από το ανατολικό τείχος της πόλης ως την περιοχή μεταξύ Πλατείας Ναυαρίνου - Αγίας Σοφίας και αποτελούσε το διοικητικό και θρησκευτικό κέντρο της πόλης."), "0", "11", "4", "5", "0", "2", "0", "0", "0"));
	 	questions.add(new Question("Ποια είναι τα υπόλοιπα κτίρια που εντάσσονται στο παραπάνω συγκρότημα?", "ΡοτόνταΑψίδα ΓαλερίουΙππόδρομος (Πλατεία Ιπποδρομίου)", "6"));
		alternatives.add(new Alternative("Ρωμαϊκή Αγορά","6"));
	    alternatives.add(new Alternative("Ροτόντα","6"));
	    alternatives.add(new Alternative("Αψίδα Γαλερίου","6"));
	    alternatives.add(new Alternative("Σιντριβάνι","6"));
	    alternatives.add(new Alternative("Ιππόδρομος (Πλατεία Ιπποδρομίου)","6"));
	    hints.add(new Hint("Η χρονική περίοδος μέσα στην οποία κτίστηκε η Ρωμαϊκή Αγορά της Θεσσαλονίκης υποστηρίζεται πως είναι το 42 π.Χ.-138 μ.Χ.", "6", "2", "0"));
		hints.add(new Hint("Η μεγάλη λεωφόρος Boulevard Hamidye (σημερινή Εθνικής Αμύνης) τελείωνε με το Σιντριβάνι, δώρο του Σουλτάνου που την οραματίστηκε, του Αβδούλ Χαμίτ. Για πολλά χρόνια θυμούνταν στην πόλη πώς στα εγκαίνια του ανάβλυσε σιρόπι από κεράσι.", "6", "4", "0"));
	 	
		// Task 7
	 	tasks.add(new Task(new Text("Στο νοτιοδυτικό τμήμα του όλου χώρου βρέθηκε ένα μεγάλο οκταγωνικό κτίσμα, το Οκτάγωνο, του οποίου η χρήση δεν προσδιορίστηκε ακόμα. Ίσως να πρόκειται για την αίθουσα του θρόνου, των ανακτόρων του Γαλερίου ή ακόμα μπορεί να ήταν αυτοκρατορικό μαυσωλείο ή ναός. Το Οκτάγωνο έχει εσωτερικά επτά κόγχες, μεγάλο προθάλαμο και κυκλικές εξέδρες. Ολόκληρο το δάπεδο αυτού του κτίσματος που έχει διάμετρο 30 μέτρα περίπου, ήταν στρωμένο με μαρμάρινες πλάκες σε υπέροχη διάταξη."), "0", "12", "2", "5", "0", "2", "0", "0", "0"));
	 	questions.add(new Question("Πόση είναι η περίμετρος του κύκλου μέσα στον οποίο εφάπτεται το οκτάγωνο? (με ακρίβεια ενός δεκαδικού ψηφίου)", "94.2", "7"));
	 	hints.add(new Hint("Θεωρείστε ότι η ακτίνα r είναι το 1/2 της διαμέτρου του Οκταγώνου.", "7", "2", "0"));
		hints.add(new Hint("Ο τύπος για τον υπολογισμό της περιμέτρου του κύκλου είναι 2*π*r όπου π=3,14.", "7", "5", "0"));
		
		// Task 8
		tasks.add(new Task(new Text("Το τελευταίο τέταρτο του 3ου αι. μ.Χ. και μετά από μια μεταβατική περίοδο της ρωμαϊκής αυτοκρατορίας με τους στρατιώτες-αυτοκράτορες ξεκίνησαν διοικητικές και οικονομικές μεταρρυθμίσεις, οι οποίες αποσκοπούν στη σταθερότητα και διαιώνισή της. Μια από τις διοικητικές μεταρρυθμίσεις ήταν η περίφημη Ρωμαϊκή «Τετραρχία», δηλαδή η διοίκηση της αυτοκρατορίας από δύο αυγούστους και δύο καίσαρες. Στο τέλος του 3ου αι. μ.Χ. αύγουστοι είναι ο Διοκλητιανός με τον Μαξιμιανό, και καίσαρες ο Γαλέριος με τον Κωνστάντιο Χλωρό."), "0", "13", "1", "5", "0", "2", "0", "0", "0"));
		questions.add(new Question("Ποιος από τους παραπάνω αυτοκράτορες δημιούργησε την Ρωμαϊκή «Τετραρχία»?", "Ο Διοκλητιανός", "8"));
		alternatives.add(new Alternative("Ο Γαλέριος","8"));
	    alternatives.add(new Alternative("Ο Μαξιμιανός","8"));
	    alternatives.add(new Alternative("Ο Κωνστάντιος Χλωρός","8"));
	    alternatives.add(new Alternative("Ο Διοκλητιανός","8"));
		hints.add(new Hint("Οι καίσαρες ήταν \"Υφιστάμενοι Αυτοκράτορες\" κάτω από τους αυγούστους.", "8", "2", "0"));
		hints.add(new Hint("Το όνομά του είναι δεύτερο αλφαβητικά.", "8", "5", "0"));
		
		// Quest - Apsida Galeriou
	    quests.add(new Quest("Αψίδα Γαλερίου", "6", new Text("Ένα από τα πιο χαρακτηριστικά μνημεία της Θεσσαλονίκης είναι η Θριαμβική Αψίδα του Γαλερίου, γνωστή και ως Καμάρα, που βρίσκεται στην πάνω πλευρά της οδού Εγνατίας και σε μικρή απόσταση από την Ροτόντα. Αποτελεί ένα από τα πιο γνωστά σημεία συνάντησης των κατοίκων και επισκεπτών της πόλης. Η Καμάρα είναι κτίσμα της εποχής της Ρωμαϊκής «Τετραρχίας» (αρχές 4ου μ.Χ. αιώνα) και αποτελεί το ένα σκέλος (δυτικό) μίας στεγασμένης στοάς, που σχηματιζόταν από αψίδες και τόξα. Κατασκευάστηκε για να τιμηθεί ο Ρωμαίος Αυτοκράτορας Γαλέριος, όταν αυτός επέστρεψε νικητής στην πόλη (περί το 306 μ.Χ.) μετά από πολέμους του κατά των Περσών. Η θριαμβική αυτή αψίδα ήταν τοποθετημένη κάθετα στην αρχαία Εγνατία, που διέσχιζε την πόλη (δυτικά προς ανατολικά) και αποτελούσε μέρος του λεγόμενου Γαλεριανού συγκροτήματος (Ρωμαϊκά Ανάκτορα), που αναπτύσσονταν κύρια νοτιοδυτικότερα, στις σημερινές πλατείες Ναυαρίνου και Ιπποδρομίου."), "3", "40.632237", "22.951741", "1", "0"));
				
	    // Task 9
		tasks.add(new Task(new Text("Ο στόχος μας σε αυτή την αποστολή είναι ένα από τα πιο χαρακτηριστικά μνημεία της Θεσσαλονίκης το οποίο αποτελεί ένα από τα πιο γνωστά σημεία συνάντησης των κατοίκων και επισκεπτών της πόλης."), "0", "1", "3", "5", "0", "3", "40.632237", "22.951741", "100"));
		questions.add(new Question("Μεταφερθείτε στο παραπάνω μνημείο", "", "9"));
		hints.add(new Hint("Βρίσκεται σε μικρή απόσταση από την Ροτόντα και την πλατεία Ναυαρίνου.", "9", "2", "0"));
		hints.add(new Hint("Μια παλιά φωτογραφία του μνημείου.", "9", "5", "6"));
	    
		// Task 10
		tasks.add(new Task(new Text("Κάτω από την Αψίδα περνούσε η βασιλική οδός (Via Regia), ένας συγκεκριμένος τύπος οδού στρατηγικής σημασίας και συγκεκριμένης νομικής υπόστασης κατά τη Ρωμαϊκή αυτοκρατορία."), "0", "7", "2", "5", "0", "3", "0", "0", "0"));
		questions.add(new Question("Πώς ονομαζόταν η συγκεκριμένη βασιλική οδός?", "Εγνατία", "10"));
		hints.add(new Hint("Η βασιλική οδός κατέληγε στην πρωτεύουσα Ρώμη.", "10", "2", "0"));
		hints.add(new Hint("Έτσι ονομάζεται και σήμερα ο παραπλήσιος δρόμος.", "10", "4", "0"));
	    
		// Task 11
		tasks.add(new Task(new Text("Αναφέρθηκε ότι η Καμάρα είναι κτίσμα της εποχής της Ρωμαϊκής «Τετραρχίας» (αρχές 4ου μ.Χ. αιώνα). Η Τετραρχία (Αρχή των τεσσάρων) ήταν ένα σύστημα διακυβέρνησης που δημιουργήθηκε από τον Αυτοκράτορα Διοκλητιανό και προέβλεπε την διαίρεση της εξουσίας, με σκοπό να λυθούν τα σοβαρά στρατιωτικά και πολιτικά προβλήματα της Ρωμαϊκής Αυτοκρατορίας."), "0", "14", "1", "5", "0", "3", "0", "0", "0"));
		questions.add(new Question("Πόσο κράτησε η Ρωμαϊκή «Τετραρχία»?", "293-324 μ.Χ.", "11"));
		alternatives.add(new Alternative("239-324 μ.Χ.","11"));
		alternatives.add(new Alternative("248-324 μ.Χ.","11"));
		alternatives.add(new Alternative("293-324 μ.Χ.","11"));
		alternatives.add(new Alternative("293-348 μ.Χ.","11"));
		hints.add(new Hint("Τελείωσε το 324 μ.Χ.", "11", "2", "0"));
		hints.add(new Hint("Κράτησε περίπου 31 χρόνια.", "11", "4", "0"));
	    
		// Task 12
		tasks.add(new Task(new Text("Η τέχνη των ανάγλυφων της Καμάρας είναι αφηγηματική και συγχρόνως διακοσμητική. Το κυριότερο χαρακτηριστικό της είναι το πλήθος των παραστάσεων και των μορφών στις οποίες συχνά παραλείπονται οι φυσικές αναλογίες. Σήμερα σώζονται δύο κύριοι πεσσοί και ένας δευτερεύον και φέρουν ως επένδυση ανάγλυφες μαρμάρινες πλάκες."), "0", "15", "4", "5", "0", "3", "0", "0", "0"));
		questions.add(new Question("Τι επιδιώκουν να προβάλουν οι πλάκες αυτές?", "Σκηνές από τις μάχες κατά των ΠερσώνΤο μέγεθος του αυτοκρατορικού στρατούΤην πολιτική ισχύ και ενότητα της Τετραρχίας", "12"));
		alternatives.add(new Alternative("Δείπνο του Γαλερίου με ακολούθους του","12"));
		alternatives.add(new Alternative("Σκηνές από τις μάχες κατά των Περσών","12"));
		alternatives.add(new Alternative("Την αρχαία Ρωμαϊκή Αγορά της Θεσσαλονίκης","12"));
		alternatives.add(new Alternative("Το μέγεθος του αυτοκρατορικού στρατού","12"));
		alternatives.add(new Alternative("Την πολιτική ισχύ και ενότητα της Τετραρχίας","12"));
		hints.add(new Hint("Κατασκευάστηκαν προς τιμήν του Γαλερίου, όταν αυτός επέστρεψε νικητής από τον πόλεμο.", "12", "2", "0"));
		hints.add(new Hint("Στις πλάκες δεν απεικονίζονται σκηνές καθημερινότητας αλλά σκηνές δόξας.", "12", "4", "0"));
		
		// Quest - Arxaia Agora
	    quests.add(new Quest("Αρχαία Αγορά", "8", new Text("Κύριο σημείο αναφοράς στην πόλη της Θεσσαλονίκης υπήρξε ο χώρος της Αρχαίας Αγοράς και στην ελληνιστική και στη ρωμαϊκή εποχή. Ιδιαίτερα στα χρόνια των Ρωμαίων ο χώρος της Αγοράς αποτελούσε το κοινωνικό και θρησκευτικό κέντρο όλης της πόλης και το χώρο όπου υπήρχαν τα πιο επιβλητικά και μεγαλοπρεπή δημόσια κτίρια. Το συγκρότημα της ρωμαϊκής Αγοράς, συνολικής έκτασης 20.000 τ.μ., στην καρδιά της πόλης, ήταν οργανωμένο γύρω από μία ορθογώνια πλακοστρωμένη πλατεία, που αποτελούσε, μαζί με τις παρακείμενες (στις τρεις πλευρές της) στοές (με κίονες κορινθιακού ρυθμού) το κατεξοχήν σημείο κοινωνικής συνάθροισης των πολιτών για την ανταλλαγή απόψεων είτε για καθημερινά ζητήματα της πόλης και της ζωής τους είτε ακόμη, για θέματα πολιτικά, φιλοσοφικά, θρησκευτικά αλλά και επιπλέον, τόπο δημόσιας ενημέρωσης για τη διεξαγωγή αθλητικών ή καλλιτεχνικών εκδηλώσεων στην πόλη."), "4", "40.637680", "22.945880", "1", "0"));

	    // Task 13
	    tasks.add(new Task(new Text("Ο στόχος μας σε αυτή την αποστολή είναι το διοικητικό κέντρο των ρωμαϊκών χρόνων το οποίο άρχισε να οργανώνεται στα μέσα του 2ου αι. μ.Χ."), "0", "1", "3", "5", "0", "4", "40.637680", "22.945880", "100"));
	    questions.add(new Question("Μεταφερθείτε στο παραπάνω χώρο", "", "13"));
	    hints.add(new Hint("Ανοικτός χώρος ο οποίος βρίσκεται βορειοδυτικά του αγάλματος του Βενιζέλου.", "13", "2", "0"));
		hints.add(new Hint("Μια παλιά φωτογραφία του χώρου.", "13", "5", "8"));
	    
		// Task 14
		tasks.add(new Task(new Text("Ο μοναδικός κίονας που βρέθηκε στον κτιστό αγωγό της ανατολικής στοάς αναστηλώθηκε την τελευταία ημέρα της ανασκαφής (31/3/1966) ΅ε πρωτοβουλία του τότε εφόρου Αρχαιοτήτων Φώτη Πέτσα. Η αναστήλωση αυτή σήμανε ουσιαστικά το τέλος του «πολέμου» μεταξύ των αρχαιολόγων που πάλευαν για την διάσωση της Αρχαίας Αγοράς και των Αρχών που προόριζαν το χώρο για την ανέγερση κτιρίου δημόσιας λειτουργίας."), "0", "9", "1", "5", "0", "4", "0", "0", "0"));
		questions.add(new Question("Τι είδους κτίριο ήθελαν να χτίσουν οι Αρχές στον χώρο της Αγοράς?", "Δικαστήρια", "14"));		
		alternatives.add(new Alternative("Διοικητήριο","14"));
	    alternatives.add(new Alternative("Δικαστήρια","14"));
	    alternatives.add(new Alternative("Νομαρχία","14"));
	    alternatives.add(new Alternative("Μουσείο","14"));		
		hints.add(new Hint("Το κτίριο βρίσκεται σήμερα στην περιοχή του Βαρδάρη.", "14", "2", "0"));
		hints.add(new Hint("Έχει ως σκοπό την απονομή της Δικαιοσύνης.", "14", "4", "0"));
		
		// Task 15
		tasks.add(new Task(new Text("Σε περίοδο προγενέστερη της διαμόρφωσης του χώρου ως Αγοράς, ένα ακόμη πολύτιμο σημείο κοινωνικοποίησης προσέφερε το συγκρότημα που αποκαλύφθηκε στη νοτιοανατολική γωνία της Αγοράς."), "0", "10", "1", "5", "0", "4", "0", "0", "0"));
		questions.add(new Question("Ποια ήταν η χρήση του συγκεκριμένου συγκροτήματος?", "Συγκρότημα λουτρών (spa)", "15"));
		alternatives.add(new Alternative("Ωδείο","15"));
	    alternatives.add(new Alternative("Βουλευτήριο","15"));
	    alternatives.add(new Alternative("Συγκρότημα λουτρών (spa)","15"));
	    alternatives.add(new Alternative("Σιντριβάνι","15"));		
		hints.add(new Hint("Η χρήση του απαιτούσε νερό για να λειτουργήσει.", "15", "2", "0"));
		hints.add(new Hint("Συντελούσε στην υγιεινή των κατοίκων.", "15", "4", "0"));		
			   
		// Task 16
		tasks.add(new Task(new Text("Εκτός από τον εμπορικό της χαρακτήρα, η Αγορά ήταν και ο τόπος στον οποίο οι αρχαίοι συζητούσαν τις πολιτικές εξελίξεις, τα κοινά, γνωρίζονταν και φιλοσοφούσαν."), "0", "16", "2", "5", "0", "4", "0", "0", "0"));
		questions.add(new Question("Πώς αποκαλείτο με την λατινική της ονομασία κατά τα ρωμαϊκά χρόνια η Αγορά? (ξένη λέξη)", "forum", "16"));
		hints.add(new Hint("Η λέξη χρησιμοποιείται και για την περιγραφή του χώρου συγκέντρωσης και συνομιλίας στο διαδίκτυο.", "16", "2", "0"));
		hints.add(new Hint("Ο πληθυντικός της λέξης είναι \"fora\".", "16", "5", "0"));
		
		// Test the servlet directly, without going through the network.
		boolean ok = pathService.addPath(new Path("Θεσσαλονίκη", "1", "Ένα διαδραστικό παιχνίδι για να μάθετε την πόλη της Θεσσαλονίκης.", quests, tasks, questions, alternatives, hints));
		assertTrue(ok);
				
		// Path Athina
		
		quests2.add(new Quest("lol", "1", new Text("lol"), "1", "40.626351", "22.948337", "2", "0"));
		quests2.add(new Quest("lol", "1", new Text("lol"),"2", "40.626351", "22.948337", "2", "0"));
		tasks2.add(new Task(new Text("lol"), "0", "1", "1", "5", "0", "1", "0", "0", "0"));
		tasks2.add(new Task(new Text("lol"), "0", "1", "1", "5", "0", "2", "0", "0", "0"));
		questions2.add(new Question("lol", "lol", "1"));
		questions2.add(new Question("lol", "lol", "2"));
		alternatives2.add(new Alternative("lol","1"));
	    alternatives2.add(new Alternative("lol","1"));
	    alternatives2.add(new Alternative("lol","1"));
	    alternatives2.add(new Alternative("lol","1"));
		alternatives2.add(new Alternative("lol","2"));
	    alternatives2.add(new Alternative("lol","2"));
	    alternatives2.add(new Alternative("lol","2"));
	    alternatives2.add(new Alternative("lol","2"));
		hints2.add(new Hint("lol", "1", "2", "0"));
		hints2.add(new Hint("lol", "1", "4", "0"));
		hints2.add(new Hint("lol", "2", "2", "0"));
		hints2.add(new Hint("lol", "2", "4", "0"));

		// Test the servlet directly, without going through the network.
		boolean ok1 = pathService.addPath(new Path("Αθήνα", "2", "Ένα διαδραστικό παιχνίδι για να μάθετε την πόλη της Αθήνας.", quests2, tasks2, questions2, alternatives2, hints2));
		assertTrue(ok1);
		
	}

}
